# Second here

In [112]:
#importing libraries

import pandas as pd

In [113]:
# reading the files

student_scores=pd.read_csv('student_scores.csv')

In [114]:
# showing the data frame

student_scores.head()

       id                       email      mobile         name  marks
0  110201           aadi.jain@tcs.com  9000900901         aadi   75.0
1  110202       aak_17yad@yahoo.co.in  9000900902    aak_17yad   75.0
2  110203  aakashrshah@rediffmail.com  9000900903  aakashrshah   76.0
3  110204          aakashzy@gmail.com  9000900904     aakashzy   77.0
4  110205          aaleya15@yahoo.com  9000900905     aaleya15   75.0

In [115]:
# function to create tags 

def fillTag(x):
    newTag=[]
    for i in x.marks:
        if(i>85):
            newTag.append('merit')
        elif (i>78):
            newTag.append('passed')
        else:
            newTag.append('failed')
    return newTag

In [116]:
# creating tags

student_scores=student_scores.assign(tag=fillTag)

In [117]:
# after creating tags

student_scores.head()

       id                       email      mobile         name  marks     tag
0  110201           aadi.jain@tcs.com  9000900901         aadi   75.0  failed
1  110202       aak_17yad@yahoo.co.in  9000900902    aak_17yad   75.0  failed
2  110203  aakashrshah@rediffmail.com  9000900903  aakashrshah   76.0  failed
3  110204          aakashzy@gmail.com  9000900904     aakashzy   77.0  failed
4  110205          aaleya15@yahoo.com  9000900905     aaleya15   75.0  failed

In [118]:
# saving it as result.csv

student_scores.to_csv('result.csv',index=False)